{
  "is_mammal": "Is it a mammal (like a dog or a human)?",
  "is_bird": "Is it a bird?",
  "is_reptile": "Is it a reptile (like a snake or lizard)?",
  "is_fish": "Is it a fish?",
  "is_amphibian": "Is it an amphibian (like a frog)?",
  "is_insect": "Is it an insect (with six legs)?",
  "is_arachnid": "Is it a spider or scorpion (with eight legs)?",
  "is_crustacean": "Is it a crustacean (like a crab or lobster)?",
  "is_mollusc": "Is it a mollusc (like a snail or octopus)?",
  "is_tiny": "Is it very tiny, smaller than your hand?",
  "is_small": "Is it small, about the size of a cat?",
  "is_medium": "Is it medium-sized, like a big dog?",
  "is_large": "Is it large, like a person or a horse?",
  "is_very_large": "Is it very large, like a car or an elephant?",
  "is_massive": "Is it truly gigantic, like a whale?",
  "is_vertebrate": "Does it have a backbone inside its body?",
  "is_invertebrate": "Does it NOT have a backbone?",
  "is_warm_blooded": "Does it make its own body heat (warm-blooded)?",
  "is_cold_blooded": "Does its body get warm or cold with the weather?",
  "has_gills_for_breathing": "Does it breathe underwater with gills?",
  "has_lungs_for_breathing": "Does it breathe air with lungs, like you do?",
  "hibernates_or_enters_torpor": "Does it sleep through the entire winter?",
  "is_bioluminescent": "Can it make its own light and glow in the dark?",
  "has_fur_or_hair": "Is it covered in fur or hair?",
  "has_feathers": "Is it covered in feathers?",
  "has_scales": "Does it have scales, like a fish or a snake?",
  "has_leathery_or_slimy_skin": "Does it have smooth, slimy, or leathery skin?",
  "has_hard_exoskeleton": "Does it have a hard shell on the outside of its body, like a beetle?",
  "has_shell": "Does it have a shell it can hide in, like a turtle or a snail?",
  "has_wings": "Does it have wings?",
  "has_fins": "Does it have fins for swimming?",
  "has_claws_paws_or_talons": "Does it have claws, paws, or sharp talons?",
  "has_hooves": "Does it have hooves, like a horse?",
  "has_horns_or_antlers": "Does it have horns or antlers on its head?",
  "has_distinct_beak_or_bill": "Does it have a beak or a bill instead of a mouth with teeth?",
  "has_tusks": "Does it have long, pointy teeth called tusks?",
  "has_tentacles_or_arms": "Does it have tentacles or wiggly arms, like an octopus?",
  "has_prehensile_tail": "Can it grab things using its tail?",
  "has_no_legs": "Does it have zero legs?",
  "has_two_legs": "Does it walk on two legs?",
  "has_four_legs": "Does it walk on four legs?",
  "has_six_legs": "Does it have exactly six legs?",
  "has_eight_legs": "Does it have exactly eight legs?",
  "has_more_than_eight_legs": "Does it have more than eight legs?",
  "has_compound_eyes": "Does it have big eyes made of tiny little dots, like a fly?",
  "has_segmented_body": "Is its body made of different parts joined together, like a caterpillar?",
  "long_and_slender_body": "Is its body long and skinny, like a noodle or a snake?",
  "compact_and_stout_body": "Is its body round and chunky, like a potato or a pig?",
  "radially_symmetrical_body": "Is its body shaped like a star or a circle?",
  "primarily_walks_or_runs": "Does it mostly move by walking or running around?",
  "primarily_climbs": "Is it a great climber of trees or rocks?",
  "primarily_swims": "Does it spend most of its life swimming?",
  "primarily_flies_or_glides": "Does it spend most of its time flying or gliding in the air?",
  "primarily_burrows_or_digs": "Does it live underground or spend a lot of time digging?",
  "is_sessile_as_adult": "As a grown-up, does it stay stuck in one spot for its whole life?",
  "moves_by_jumping_or_leaping": "Is it famous for hopping or jumping?",
  "is_terrestrial": "Does it live only on land?",
  "is_aquatic": "Does it live only in the water?",
  "is_semi_aquatic": "Does it live both in water AND on land, like a frog?",
  "is_arboreal": "Does it live most of its life up in the trees?",
  "is_fossorial": "Does it live most of its life underground?",
  "lives_in_freshwater": "Does it live in a river or a lake (fresh water)?",
  "lives_in_marine_water": "Does it live in the big, salty ocean?",
  "lives_in_polar_regions": "Does it live in a very cold, snowy place like the North or South Pole?",
  "lives_in_forests_or_woodlands": "Does it live in a forest with lots of trees?",
  "lives_in_grasslands_or_savannas": "Does it live in an open, grassy field with few trees?",
  "lives_in_deserts_or_arid_regions": "Does it live in a hot, dry desert?",
  "common_in_urban_areas": "Do you often see it in cities or towns where people live?",
  "is_carnivore": "Does it only eat meat?",
  "is_herbivore": "Does it only eat plants?",
  "is_omnivore": "Does it eat both plants and meat?",
  "is_insectivore": "Does it mostly eat bugs and insects?",
  "is_piscivore": "Does it mostly eat fish?",
  "is_filter_feeder": "Does it eat by sucking tiny food out of the water?",
  "is_scavenger": "Does it eat animals that are already dead?",
  "eats_nectar_pollen_or_fruit": "Does it eat sweet flower nectar, pollen, or fruit?",
  "is_parasitic": "Does it live on another animal and bother it, like a flea on a dog?",
  "lays_eggs": "Does it lay eggs?",
  "gives_live_birth": "Does it give birth to live babies instead of laying eggs?",
  "undergoes_metamorphosis": "Does it completely change its body as it grows, like a caterpillar turning into a butterfly?",
  "provides_extensive_parental_care": "Do its parents take great care of their babies for a long time?",
  "has_no_parental_care": "Do its babies have to take care of themselves as soon as they are born?",
  "carries_young_in_pouch": "Does it carry its babies in a pouch on its belly?",
  "is_highly_social_or_eusocial": "Does it live in a big, busy family or colony, like bees or ants?",
  "lives_in_small_groups_or_pairs": "Does it live with just a small family or a partner?",
  "is_solitary": "Does it usually live all by itself?",
  "is_territorial": "Does it protect its own special area from other animals?",
  "is_apex_predator": "Is it a top hunter that no other animals hunt?",
  "uses_camouflage_or_mimicry": "Can it hide by blending in or looking like something else?",
  "has_venom_or_poison": "Is it venomous or poisonous?",
  "uses_armor_or_spines_for_defense": "Does it protect itself with a hard shell or sharp spikes?",
  "releases_noxious_chemicals": "Does it spray a stinky smell to protect itself?",
  "relies_on_speed_to_escape": "Is it super fast so it can run away from danger?",
  "is_domesticated": "Is it an animal that people keep as a pet or on a farm?",
  "migrates_seasonally": "Does it travel a very long way every year for winter or summer?",
  "builds_complex_structures": "Is it known for building things, like a nest, a web, or a dam?",
  "uses_tools": "Is it smart enough to use tools, like using a rock to open a shell?",
  "communicates_with_complex_vocalizations": "Does it make a lot of different sounds, like songs or special calls, to 'talk'?",
  "is_nocturnal": "Is it mostly awake and active at night?",
  "is_diurnal": "Is it mostly awake and active during the day?"
}