{
  "is_mammal": "Is it a mammal, like a cat, dog, or human?",
  "is_bird": "Is it a bird?",
  "is_reptile": "Is it a reptile, like a snake or a lizard?",
  "is_fish": "Is it a fish?",
  "is_amphibian": "Is it an amphibian, like a frog?",
  "is_insect": "Is it an insect, like an ant or a fly?",
  "is_arachnid": "Is it an arachnid, like a spider?",
  "is_crustacean": "Is it a crustacean, like a crab or lobster?",
  "is_mollusc": "Is it a mollusc, like a snail or an octopus?",
  "is_tiny": "Is it tiny, smaller than your hand?",
  "is_small": "Is it small, about the size of a cat?",
  "is_medium": "Is it medium-sized, like a large dog?",
  "is_large": "Is it large, like a person or a horse?",
  "is_very_large": "Is it very large, like a car or an elephant?",
  "is_massive": "Is it gigantic, like a whale?",
  "is_vertebrate": "Does it have a backbone?",
  "is_invertebrate": "Does it have no backbone?",
  "is_warm_blooded": "Does it stay warm by making its own body heat?",
  "is_cold_blooded": "Does its body temperature change with the weather?",
  "has_gills_for_breathing": "Does it breathe underwater using gills?",
  "has_lungs_for_breathing": "Does it breathe air with lungs, like people do?",
  "hibernates_or_enters_torpor": "Does it sleep through the winter?",
  "is_bioluminescent": "Can it glow in the dark?",
  "has_fur_or_hair": "Is it covered in fur or hair?",
  "has_feathers": "Is it covered in feathers?",
  "has_scales": "Does it have scales, like a fish or snake?",
  "has_leathery_or_slimy_skin": "Is its skin smooth, slimy, or leathery?",
  "has_hard_exoskeleton": "Does it have a hard outer shell for a body, like a beetle?",
  "has_shell": "Does it have a shell it can hide inside, like a turtle or snail?",
  "has_wings": "Does it have wings?",
  "has_fins": "Does it have fins for swimming?",
  "has_claws_paws_or_talons": "Does it have paws, claws, or talons?",
  "has_hooves": "Does it have hooves, like a horse?",
  "has_horns_or_antlers": "Does it have horns or antlers?",
  "has_distinct_beak_or_bill": "Does it have a beak, like a bird?",
  "has_tusks": "Does it have long teeth called tusks, like an elephant?",
  "has_tentacles_or_arms": "Does it have tentacles or wiggly arms?",
  "has_prehensile_tail": "Can it grab things with its tail?",
  "has_no_legs": "Does it have no legs at all?",
  "has_two_legs": "Does it walk on two legs?",
  "has_four_legs": "Does it walk on four legs?",
  "has_six_legs": "Does it have exactly six legs?",
  "has_eight_legs": "Does it have exactly eight legs?",
  "has_more_than_eight_legs": "Does it have more than eight legs?",
  "has_compound_eyes": "Does it have eyes made of many tiny parts, like a fly?",
  "has_segmented_body": "Is its body made of different sections joined together, like a caterpillar?",
  "long_and_slender_body": "Is its body long and skinny, like a snake?",
  "compact_and_stout_body": "Is its body short and stocky, or round and chunky?",
  "radially_symmetrical_body": "Is its body shaped like a circle or a star?",
  "primarily_walks_or_runs": "Does it mostly get around by walking or running?",
  "primarily_climbs": "Is it known for climbing trees or rocks?",
  "primarily_swims": "Does it spend most of its life swimming?",
  "primarily_flies_or_glides": "Does it spend most of its time flying or gliding?",
  "primarily_burrows_or_digs": "Does it spend most of its time digging or living underground?",
  "is_sessile_as_adult": "As an adult, does it stay attached to one spot for life?",
  "moves_by_jumping_or_leaping": "Is it known for hopping or jumping?",
  "is_terrestrial": "Does it live exclusively on land?",
  "is_aquatic": "Does it live exclusively in the water?",
  "is_semi_aquatic": "Does it live both on land and in water?",
  "is_arboreal": "Does it live most of its life in trees?",
  "is_fossorial": "Does it live most of its life underground?",
  "lives_in_freshwater": "Does it live in freshwater, like a lake or river?",
  "lives_in_marine_water": "Does it live in the salty ocean?",
  "lives_in_polar_regions": "Does it live where it's very cold and snowy, like the arctic?",
  "lives_in_forests_or_woodlands": "Does it live in a forest?",
  "lives_in_grasslands_or_savannas": "Does it live in big, open, grassy fields?",
  "lives_in_deserts_or_arid_regions": "Does it live in a hot, dry desert?",
  "common_in_urban_areas": "Is it commonly found in cities or neighborhoods?",
  "is_carnivore": "Does it eat only meat?",
  "is_herbivore": "Does it eat only plants?",
  "is_omnivore": "Does it eat both plants and meat?",
  "is_insectivore": "Does it mostly eat insects?",
  "is_piscivore": "Does it mostly eat fish?",
  "is_filter_feeder": "Does it eat by filtering tiny food out of the water?",
  "is_scavenger": "Does it eat animals that are already dead?",
  "eats_nectar_pollen_or_fruit": "Does it eat fruit, pollen, or nectar from flowers?",
  "is_parasitic": "Does it live on or inside another creature?",
  "lays_eggs": "Does it lay eggs?",
  "gives_live_birth": "Does it give birth to live babies?",
  "undergoes_metamorphosis": "Does its body completely change as it grows up, like a caterpillar becoming a butterfly?",
  "provides_extensive_parental_care": "Do the parents take care of their babies for a long time?",
  "has_no_parental_care": "Do babies have to take care of themselves right after they're born?",
  "carries_young_in_pouch": "Does it carry its babies in a pouch?",
  "is_highly_social_or_eusocial": "Does it live in a big group, like a colony or a hive?",
  "lives_in_small_groups_or_pairs": "Does it live in a small group or with a partner?",
  "is_solitary": "Does it prefer to live alone?",
  "is_territorial": "Does it guard its home area from others?",
  "is_apex_predator": "Is it at the top of the food chain with no natural predators?",
  "uses_camouflage_or_mimicry": "Does it use camouflage to blend in with its surroundings?",
  "has_venom_or_poison": "Is it venomous or poisonous?",
  "uses_armor_or_spines_for_defense": "Does it have armor, spines, or a hard shell for protection?",
  "releases_noxious_chemicals": "Does it spray a bad smell or chemical to defend itself, like a skunk?",
  "relies_on_speed_to_escape": "Does it use its speed to escape from danger?",
  "is_domesticated": "Is it a domestic animal, like a pet or farm animal?",
  "migrates_seasonally": "Does it migrate, traveling long distances for the seasons?",
  "builds_complex_structures": "Is it known for building things, like a nest, web, or dam?",
  "uses_tools": "Is it smart enough to use tools?",
  "communicates_with_complex_vocalizations": "Does it use complex sounds, like songs or calls, to communicate?",
  "is_nocturnal": "Is it nocturnal, meaning it's active at night?",
  "is_diurnal": "Is it diurnal, meaning it's active during the day?"
}